content/post/review-read-2020.md
+++
title = "我的 2020 年阅读总结"
date = 2021-02-01T15:54:00+08:00
lastmod = 2021-02-01T16:04:43+08:00
tags = ["记录", "总结", "反思", "阅读"]
draft = false
+++

回顾 2020 年的阅读，并没有做很好的梳理。因为琐事繁多，没能有计划的进行主题阅读。算是 2020 年的一大缺憾。

以下列出我在 2020  年读过的好书。

<!--more-->


## 《霍乱时期的爱情》 - 杰作 {#霍乱时期的爱情-杰作}

马尔克斯的名作，疫情封锁期间看的。永恒的忠诚和不渝的爱情，似乎很令人向往吧？可通篇读来，却满是孤独。


## 《走出唯一真理观》 - 杰作 {#走出唯一真理观-杰作}

这本书是我在本年度读过的最好的一本书。感触较深的几章：

-   读懂一两个大哲学家
-   思想增益元气
-   哲学关心的是事物的意义
-   说理与对话
-   “说理”四人谈
-   反思与过度反思

陈嘉映老师是我的楷模。我读书读的很杂，什么都想了解一点，什么都想学习一点，却经常有一个问题困扰自己，这些书本上的知识究竟对我的现实生活有什么用？找不到答案。为什么找不到？因为事儿做的太少，人生经验太少，专业知识又不足，反思这个、反思那个，反思的结果除了徒增痛苦，没任何意义。最终还是要落实到实际行动上去啊！

「要靠比较厚重一点的生活把反思托起来，否则，反思会飘起来，我们会飘在反思里。」

陈嘉映老师的著作，确实给了我非常大的警醒：多做事、多行动，少反思、少乱想。

还有关于学习方面的启发：比如想学习哲学，先读懂一两个大哲学家，翻译是很好的训练。


## 《沈从文的前半生》，《沈从文的后半生》 - 杰作 {#沈从文的前半生-沈从文的后半生-杰作}

沈从文的传记。他的一生，见证了 20 世纪中国的时局动荡，而这些动荡，又是如何一次又一次的影响了他个人的命运变迁。很遗憾，沈老在建国之后就基本没怎么写作了。但是看到后面，经历了种种磨难，年近80的沈老前往美国，与阔别了几十年的老友会面，在美国巡回演讲，真是深受感动。


## 《黑客与画家》 - 杰作 {#黑客与画家-杰作}

主要是重读了「设计」相关的内容。任何一项工作，如果只是把它当作枯燥乏味的一套流程，那么就丧失了提升「品味」的可能性。

怎么样提升品味呢？前提是把自己当作设计者，然后不断从事设计工作，模仿他人好的设计。要勤于思考为什么这样设计更好，而不是那样。向大众、同行展示，从外界获取反馈。一个好的设计，必然是要有人认可的。

为什么会存在比其他设计更好的杰出设计？这是一个好问题，作者在《设计者的品味》这一章节中也列出了「好设计」的共同原则。这一章节适合经常拿出来重读，反思自己的设计。

> 好设计是简单的设计
> 好设计是永远不过时的设计
> 好设计是解决主要问题的设计
> 好设计是启发性的设计
> 好设计通常是有点趣味性的设计
> 好设计是艰苦的设计
> 好设计是看似很容易的设计
> 好设计是对称的设计
> 好设计是模仿大自然的设计
> 好设计是一种再设计
> 好设计是能够复制的设计
> 好设计常常是奇特的设计
> 好设计是成批出现的
> 好设计常常是大胆的设计
>
> ——《设计者的品味》

关于好设计，我自己的补充：有序好过无序；和谐好过混乱；理性好过大众直觉。

> 先做出原型，再逐步加工做出成品，这种方式有利于鼓舞士气，因为它使得你随时都可以看到工作的成效。开发软件的时候，我有一条规则：任何时候，代码都必须能够运行。如果你正在写的代码一个小时之后就可以看到运行结果，这好比让你看到不远处就是唾手可得的奖励，你因此会受到激励和鼓舞。
>
> “用户需要的设计”，而不是“用户要求的设计”，
> 除非设定目标用户，否则一种设计的好坏根本无从谈起。
>
> ——《设计与研究》


## 逍遥游:当《庄子》遭遇现实 - 力作 {#逍遥游-当-庄子-遭遇现实-力作}

在《后记》中，熊逸先生谈了他的研究方法：

一、走进去：

「借鉴人类学家在土著部落搞田野调查的态度，即深入到土著人的生活里，讲他们的语言，参加他们的礼拜和狂欢，先让自己成为他们的一员，在他们的内部理解他们」。

二、走出来：

「所谓走出来，就是用现代知识来思考古代社会。毕竟文明发展了，知识进步了，今天种种社会科学的研究已经大大超越于古人之上，让我们可以站在无数巨人的肩膀上，享受一下比古人耳聪目明的乐趣。」


## 《构建之法：现代软件工程》 - 力作 {#构建之法-现代软件工程-力作}

由于我没受过系统的计算机教育，实际的开发经验也并不多，对于「软件工程」始终只有一个模糊的概念。我在此前也接触过其他的「软件工程」的教材，印象中过于偏重理论了，读者根本不知从哪里开始实践（很可能教材的著作者本身就缺乏实践）。邹欣老师的这本书就很不一样，有趣、且实际的多，这可能是因为邹老师有大量的一线软件开发的经验，他能够把理论与实践很好的结合起来。这本书可以作为一本「软件开发」的长期参考书。


## 《探索智慧：从达尔文到芒格》 - 可用的书 {#探索智慧-从达尔文到芒格-可用的书}

又是一本参考书。不知如何评价。算是对芒格的所有公开出版物的笔记汇总。


## NET Bible {#net-bible}

-   [New English Translation - Wikipedia](https://en.wikipedia.org/wiki/New%5FEnglish%5FTranslation)
-   [NET Bible](https://netbible.org/bible/) - 免费在线阅读

NET 是 New English Translation 的简称，新翻译的语言更贴近当代读者的日常使用习惯。我纯粹是好奇《圣经》说了什么，顺便学习英语。读了几个篇章。


## The Alchemist - 力作 {#the-alchemist-力作}

中文译名是《牧羊少年奇幻之旅》。一本非常轻松好读的小书。很多有意思的金句，部分摘录：

> It’s what you have always wanted to accomplish. Everyone, when they are young, knows what their Personal Legend is.
>
> It prepares your spirit and your will, because there is one great truth on this planet: whoever you are, or whatever it is that you do, when you really want something, it’s because that desire originated in the soul of the universe. It’s your mission on earth.
>
> The secret of happiness is to see all the marvels of the world, and never to forget the drops of oil on the spoon.

<!--quoteend-->

> To do that successfully, I must have no fear of failure. It was my fear of failure that first kept me from attempting the Master Work.
>
> Courage is the quality most essential to understanding the Language of the World.
>
> When a person really desires something, all the universe conspires to help that person to realize his dream.
>
> What you still need to know is this: before a dream is realized, the Soul of the World tests everything that was learned along the way. It does this not because it is evil, but so that we can, in addition to realizing our dreams, master the lessons we’ve learned as we’ve moved toward that dream. That’s the point at which most people give up. It’s the point at which, as we say in the language of the desert, one ‘dies of thirst just when the palm trees have appeared on the horizon.
>
> It said that the darkest hour of the night came just before the dawn.
>
> Everything that happens once can never happen again. But everything that happens twice will surely happen a third time.
>
> No matter what he does, every person on earth plays a central role in the history of the world. And normally he doesn’t know it.
>
> And above all for his having met a woman of the desert who had told him that love would never keep a man from his Personal Legend.


## 往年回顾 {#往年回顾}

-   [我的 2018 年阅读总结 - 贤民的比特记忆](https://www.xianmin.org/post/2018-read/)
-   [我的 2019 年阅读总结 - 贤民的比特记忆](https://www.xianmin.org/post/review-read-2019/)
